# SpatialFieldMgrLegendHorOriginGap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpatialFieldMgrLegendHorOriginGap Property
ParameterTypeId Class See Also
---
"Legend Horizontal Origin Gap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpatialFieldMgrLegendHorOriginGap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpatialFieldMgrLegendHorOriginGap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpatialFieldMgrLegendHorOriginGap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace